package algorithms.Homework6;

public class Theory {
    /*
     * Приведите пример использования амортизированного анализа в практике.
     *
     * Применяется в математике, бухгалтерии. бизнесе, если речь идет о применении из жизни.
     *
     * Суть в том, чтобы из большого количества операций, большинство из которых легкие, и всего несколько - сложные,
     * создать такой алгоритм, который в реднем будет иметь константную сложность, за исключением редких моментов,
     * когда эта сложность возрастет до линейной.
     *
     * Отличный пример был приведен на лекции - с ведением бизнеса, с кредитованием, и методами предоплаты.
     * Из личного опыта вспоминается работа - обычный рабочий день с текущими небольшими задачами, и конец месяца -
     * завал с отчетами. То же самое можно сказать о буднях простого программиста - константная сложность (О(1)) и
     * день релиза - резкое увеличение сложности, которое амартизируется за счет остальных дней.
     *
     * В программировании - применение алгоритма может быть в ArrayList - динамическом массиве - при добавлении новых элементов.
     *
     * */
}
